#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, ГрафикРаботы) Экспорт 
	
	//Заполнить регистр сведений "ВКМ_ГрафикиРаботы" рабочими днями в зависимости от графика
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить(ГрафикРаботы);
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	ДатаОтсчета = ДатаНачала;
	
	Для КоличествоЗаписей = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[КоличествоЗаписей];
		Если Запись.Дата < ДатаНачала Тогда
			Продолжить;
		ИначеЕсли Запись.Дата = ДатаОтсчета Тогда
			Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ДатаОтсчета))) Тогда
				Запись.Значение = 0;
			Иначе
				Запись.Значение = 1;
			КонецЕсли;
			ДатаОтсчета = ДатаОтсчета + ЧислоСекундВСутках;
		Иначе
			Пока ДатаОтсчета < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ГрафикРаботы = ГрафикРаботы;
				НоваяЗапись.Дата = ДатаОтсчета;
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ДатаОтсчета))) Тогда
					НоваяЗапись.Значение = 0;
				Иначе
					НоваяЗапись.Значение = 1;
				КонецЕсли;
				ДатаОтсчета = ДатаОтсчета + ЧислоСекундВСутках;
			КонецЦикла;
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ДатаОтсчета))) Тогда
					Запись.Значение = 0;
				Иначе
					Запись.Значение = 1;
				КонецЕсли;
			КонецЕсли;
			ДатаОтсчета = ДатаОтсчета + ЧислоСекундВСутках;
		КонецЕсли;
		
	КонецЦикла;
	Набор.Записать();
	
	Пока ДатаОтсчета <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.ГрафикРаботы = ГрафикРаботы;
		Запись.Дата = ДатаОтсчета;
		Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ДатаОтсчета))) Тогда
			Запись.Значение = 0;
		Иначе
			Запись.Значение = 1;
		КонецЕсли;
		ДатаОтсчета = ДатаОтсчета + ЧислоСекундВСутках;
	КонецЦикла;
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли