
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура getUpdates(Команда)
	getUpdatesНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура sendMessage(Команда)
	sendMessageНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура getUpdatesНаСервере()
	
	РезультатДанныеJSON = ВКМ_МетодыТелеграм.ПолучитьОбновления_getUpdates();
	
	РезультатЗапроса = ВКМ_СлужебныеТелеграм.СформироватьJSON(РезультатДанныеJSON, Истина);
	
КонецПроцедуры

&НаСервере
Процедура sendMessageНаСервере()
	
	Результат = ВКМ_РегламентныеТелеграм.СообщенияТелеграмБот();
	
	РезультатЗапроса = ВКМ_СлужебныеТелеграм.СформироватьJSON(Результат, Истина);
	
КонецПроцедуры

#КонецОбласти

