
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
// ВКМ_Захарова: Если вид номенклатуры услуга, сделать реквизит "ЕдиницаИзмерения" не обязательным к заполнению
	
	Если ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Товар Тогда
		
		НомерУдаляемого = ПроверяемыеРеквизиты.Найти("ЕдиницаИзмерения");
		Если НомерУдаляемого <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерУдаляемого);
		КонецЕсли;
		
	КонецЕсли;
	
// ВКМ_Захарова
КонецПроцедуры

#КонецОбласти

#КонецЕсли
